trunk/src/QuanLyDiemComApp/test/TestXemDiem/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyDiemComApp">
  <soapenv:Body>
    <quan:XemDiemOperation>
      <id_hocsinh>1</id_hocsinh>
      <hocky>1</hocky>
      <id_namhoc>1</id_namhoc>
      <id_monhoc>1</id_monhoc>
      <id_lop>1</id_lop>
    </quan:XemDiemOperation>
  </soapenv:Body>
</soapenv:Envelope>